# Action conditions

no-condition.title=Todos os elementos
no-condition.description=Esta condici\u00F3n coincidir\u00E1 cos elementos engadidos ao espazo. Util\u00EDcea cando desexe aplicar unha acci\u00F3n a todo o que se engada ao espazo.

compare-property-value.title=Elementos que conte\u00F1en un valor espec\u00EDfico no  nome
compare-property-value.description=A regra apl\u00EDcase a todos os elementos que te\u00F1en un valor espec\u00EDfico no nome.

in-category.title=Elementos co valor de categor\u00EDa especificado
in-category.description=A regra apl\u00EDcase a todos os elementos que te\u00F1en un valor de categor\u00EDa especificado.

is-subtype.title=Elementos dun tipo especificado ou dos seus subtipos
is-subtype.description=A regra apl\u00EDcase a todos os elementos dun tipo especificado ou dos seus subtipos 

has-aspect.title=Elementos que te\u00F1en un aspecto espec\u00EDfico aplicado
has-aspect.description=A regra apl\u00EDcase a todos os elementos que te\u00F1en un aspecto espec\u00EDfico aplicado.

compare-mime-type.title=Elementos co tipo de mime especificado
compare-mime-type.description=A regra apl\u00EDcase a todos os elementos que te\u00F1en o contido de tipo mime especificado.

# Actions

add-features.title=Engadir aspecto ao elemento
add-features.description=Isto engadir\u00E1 un aspecto ao elemento coincidente.

remove-features.title=Eliminar un aspecto dun elemento
remove-features.description=Isto eliminar\u00E1 un aspecto do elemento coincidente.

simple-workflow.title=Engadir fluxo de traballo simple ao elemento
simple-workflow.description=Isto engadir\u00E1 un fluxo de traballo simple ao elemento coincidente, o que permitir\u00E1 mover o elemento a outro espazo para o seguinte paso do fluxo. Tam\u00E9n pode fornecer un espazo ao cal movelo se desexa rexeitar un paso.
			
link-category.title=Ligar elemento \u00E1 categor\u00EDa
link-category.description=Isto aplicar\u00E1 unha categor\u00EDa ao elemento coincidente.

transform.title=Transformar e copiar contido nun espazo espec\u00EDfico
transform.description=Isto transformar\u00E1 o contido coincidente e copiar\u00E1 o resultado nun espazo espec\u00EDfico

transform-image.title=Transformar e copiar a imaxe nun espazo espec\u00EDfico
transform-image.description=Isto transformar\u00E1 a imaxe coincidente e copiar\u00E1 o resultado nun espazo espec\u00EDfico

copy.title=Copiar elemento nun espazo espec\u00EDfico
copy.description=Isto copiar\u00E1 o elemento coincidente noutro espazo.

move.title=Mover elemento a un espazo espec\u00EDfico
move.description=Isto mover\u00E1 o elemento coincidente a outro espazo.

mail.title=Enviar un correo electr\u00F3nico aos usuarios especificados
mail.description=Isto enviar\u00E1 un correo electr\u00F3nico \u00E1 lista de usuarios cando coincida o contido.

check-in.title=Protexer o contido
check-in.description=Isto protexer\u00E1 o contido coincidente.

check-out.title=Desprotexer o contido
check-out.description=Isto desprotexer\u00E1 o contido coincidente.

set-property-value.title=Definir o valor dunha propiedade
set-property-value.description=Isto definir\u00E1 o valor dunha propiedade para un valor dado.

import.title=Importar un paquete de contido de Alfresco
import.description=Importa un paquete de contido de Alfresco ao repositorio.

extract-metadata.title=Extraer campos de metadatos com\u00FAns do contido
extract-metadata.description=Importa campos de metadatos de descrici\u00F3n,  autor e t\u00EDtulo dos tipos de contido com\u00FAns.

specialise-type.title=Especializar o tipo de elementos
specialise-type.description=Isto especializar\u00E1 o elemento coincidente nun tipo dado. 

export.title=Exportar un espazo
export.description=Exporta un espazo e opcionalmente os seus secundarios a un paquete de exportaci\u00F3n Alfresco.
export.package.description=Paquete de contidos de Alfresco do espazo ''{0}''.
export.root.package.description=Paquete de contidos de Alfresco de todo o repositorio.
export.store.package.description=Exportaci\u00F3n do repositorio de Alfresco do almac\u00E9n ''{0}''.
export.generic.package.description=Exportaci\u00F3n do repositorio de Alfresco.
export.package.error=Erro ao localizar o ficheiro temporal de exportaci\u00F3n

script.title=Executar unha secuencia de comandos
script.description=Executar un ficheiro JavaScript para executar tarefas tal como a creaci\u00F3n de ficheiros e cartafoles.

counter.title=Contador de incremento
counter.counter=Incrementar as propiedades do contador do elemento.

execute-all-rules.title=Executar todas as regras
execute-all-rules.description=Executar todas as regras nos elementos secundarios.

start-workflow.title=Iniciar o fluxo de traballo
start-workflow.description=Isto iniciar\u00E1 fluxos de traballo para os elementos coincidentes.

# WCM Actions

simple-avm-submit.title=Env\u00EDo directo simple
simple-avm-submit.description=Isto enviar\u00E1 alg\u00FAns dos n\u00F3s novos do elemento coincidente \u00E1 representaci\u00F3n correspondente.

simple-avm-promote.title=Subida en sandbox simple
simple-avm-promote.description=Esta opci\u00F3n sobe alg\u00FAns n\u00F3s recentes do elemento coincidente \u00E1 sandbox de destino especificada.
simple-avm-promote.target-store.display-label=O nome do almac\u00E9n AVM de destino.

avm-revert-store.title=Reverter un n\u00F3 simple nun almac\u00E9n.
avm-revert-store.description=Isto devolve todos os n\u00F3s, inclu\u00EDndo o do argumento e inferiores, \u00E1 versi\u00F3n anterior.
avm-revert-store.version.display-label=A versi\u00F3n \u00E1 cal se reverte.

avm-revert-list.title=Reverter unha lista de n\u00F3s nun almac\u00E9n.
avm-revert-list.description=Isto reverte todos os n\u00F3s inclu\u00EDdos na lista.
avm-revert-list.version.display-label=A versi\u00F3n \u00E1 cal se reverte.
avm-revert-list.node-list.display-label=A cadea codificou a lista de n\u00F3s \u00E1 cal se reverte.
avm-revert-list.flatten.display-label=Se se simplifica nun almac\u00E9n de representaci\u00F3n despois da reversi\u00F3n.
avm-revert-list.store.display-label=Nome do almac\u00E9n que se est\u00E1 a reverter. S\u00F3 necesario se simplifica.
avm-revert-list.staging.display-label=O nome do almac\u00E9n de representaci\u00F3n ao cal simplificar.
avm-revert-list.flatten-path.display-label=O cami\u00F1o relativo ao almac\u00E9n que se debe simplificar.

avm-revert-to-version.title=Reverter un n\u00F3 a unha versi\u00F3n particular.
avm-revert-to-version.description=Isto reverte un n\u00F3 a unha versi\u00F3n particular dese n\u00F3.
avm-revert-to-version.to-revert.display-label=O descritor do n\u00F3 AVM da versi\u00F3n \u00E1 cal reverter.

avm-undo-list.title=Faga unha lista de n\u00F3s nun almac\u00E9n transparente \u00E1 representaci\u00F3n.
avm-undo-list.description=Isto act\u00FAa como un borrador de erros dunha sandbox de usuario.
avm-undo-list.node-list.display-label=A cadea codificou a lista de n\u00F3s \u00E1 cal se reverte.

avm-deploy-snapshot.title=Despregar unha instant\u00E1nea nun servidor remoto.
avm-deploy-snapshot.description=Isto desprega unha instant\u00E1nea do sitio web nun servidor remoto.
avm-deploy-snapshot.website.display-label=Referencia do n\u00F3 do sitio web desde onde est\u00E1 a realizarse o despregamento.
avm-deploy-snapshot.target-server.display-label=O nome ou enderezo IP do servidor remoto no cal despregar.
avm-deploy-snapshot.default-rmi-port.display-label=O porto RMI predefinido para conectarse se este non \u00E9 substitu\u00EDdo no par\u00E1metro do servidor de destino.
avm-deploy-snapshot.remote-username.display-label=O nome para conectarse como usuario.
avm-deploy-snapshot.remote-password.display-label=Contrasinal do nome de usuario remoto.
avm-deploy-snapshot.deploy-callback.display-label=O obxecto listener da chamada de retorno de despregamento.
avm-deploy-snapshot.delay.display-label=Un atraso opcional para aplicar o inicio dun despregamento.

start-avm-workflow.title=Iniciar un fluxo de traballo WCM
start-avm-workflow.description=Inicia un fluxo de traballo esperando un paquete de fluxo de traballo AVM
start-avm-workflow.store-name.display-label=Almacenar nome da tarefa de inicio
start-avm-workflow.workflow-name.display-label=O nome do fluxo de traballo WCM a invocar.

copy-to-web-project.title=Copiar elemento nun cartafol dun proxecto web
copy-to-web-project.description=Isto copiar\u00E1 o elemento coincidente nun cartafol dun proxecto web.

avm-link-validation.title=Executa unha verificaci\u00F3n da validaci\u00F3n da ligaz\u00F3n.
avm-link-validation.description=Executa unha verificaci\u00F3n da validaci\u00F3n da ligaz\u00F3n.
avm-link-validation.monitor.display-label=O obxecto de estado utilizado para determinar o progreso
avm-link-validation.compare-to-staging.display-label=Determina se a verificaci\u00F3n da ligaz\u00F3n deber\u00EDa utilizar a \u00E1rea de representaci\u00F3n da comparaci\u00F3n

