##
## Web Script Response Codes
##
webscript.code.100.name=Continuar
webscript.code.100.description=O cliente pode continuar.
webscript.code.101.name=Mudando protocolos
webscript.code.101.description=O servidor est\u00E1 a mudar os protocolos conforme a actualizaci\u00F3n de cabeceiras.
webscript.code.200.name=Aceptar
webscript.code.200.description=A solicitude completouse con normalidade.
webscript.code.201.name=Creado
webscript.code.201.description=A solicitude completouse con \u00E9xito e creou un recurso no servidor.
webscript.code.202.name=Aceptado
webscript.code.202.description=A solicitude foi aceptada para o seu procesamento mais non se completou.
webscript.code.203.name=Informaci\u00F3n non certificada
webscript.code.203.description=A metainformaci\u00F3n presentada polo cliente non se orixinou no servidor.
webscript.code.204.name=NO contentSC_NO_CONTENT
webscript.code.204.description=A solicitude completouse mais non hab\u00EDa ningunha informaci\u00F3n nova que devolver.
webscript.code.205.name=Restablecer contido
webscript.code.205.description=O axente TEN que restablecer a visualizaci\u00F3n de documento que causou o env\u00EDo da solicitude.
webscript.code.206.name=Contido parcial
webscript.code.206.description=O servidor satisfixo a solicitude GET parcial relativa ao recurso.
webscript.code.300.name=Varias opci\u00F3ns
webscript.code.300.description=O recurso solicitado corresp\u00F3ndese con calquera dun conxunto de representaci\u00F3ns, cada un deles coa s\u00FAa propia localizaci\u00F3n.
webscript.code.301.name=Movido de xeito permanente
webscript.code.301.description=O recurso moveuse a unha nova localizaci\u00F3n de xeito permanente polo que as referencias futuras ter\u00E1n que utilizar un novo URI para as solicitudes.
webscript.code.302.name=Movido temporalmente
webscript.code.302.description=O recurso moveuse a outra localizaci\u00F3n temporalmente; por\u00E9n, as referencias futuras te\u00F1en que utilizar a\u00EDnda o URI orixinal para acceder ao recurso.
webscript.code.303.name=Ver outro
webscript.code.303.description=A resposta \u00E1 solicitude p\u00F3dese encontrar noutro URI.
webscript.code.304.name=Non modificado
webscript.code.304.description=Unha operaci\u00F3n GET condicional encontrou que o recurso est\u00E1 dispo\u00F1ible mais sen modificar.
webscript.code.305.name=Utilizar servidor mandatario
webscript.code.305.description=Ao recurso solicitado TEN que accederse a trav\u00E9s do servidor mandatario fornecido polo campo Localizaci\u00F3n.
webscript.code.400.name=Solicitude incorrecta
webscript.code.400.description=A solicitude enviada polo cliente presenta incorrecci\u00F3ns sint\u00E1cticas.
webscript.code.401.name=Non autorizado
webscript.code.401.description=A solicitude require unha autenticaci\u00F3n HTTP.
webscript.code.402.name=Requ\u00EDrese pagamento
webscript.code.402.description=Reservado para o seu uso no futuro
webscript.code.403.name=Prohibido
webscript.code.403.description=O servidor comprendeu a solicitude mais rexeitou satisfacela.
webscript.code.404.name=Non localizado
webscript.code.404.description=O recurso da solicitude non est\u00E1 dispo\u00F1ible.
webscript.code.405.name=M\u00E9todo non permitido
webscript.code.405.description=O m\u00E9todo especificado na li\u00F1a da solicitude non est\u00E1 permitido para o recurso identificado polo URI.
webscript.code.406.name=Inadecuado
webscript.code.406.description=O recurso identificado pola solicitude s\u00F3 consegue xerar entidades de resposta cun tipo de contido que non se adec\u00FAa \u00E1s cabeceiras Accept enviadas na solicitude.
webscript.code.407.name=Requ\u00EDrese autenticaci\u00F3n de servidor mandatario
webscript.code.407.description=En primeiro lugar, o cliente TEN que se autenticar por medio do servidor mandatario.
webscript.code.408.name=Tempo de espera da solicitude
webscript.code.408.description=O cliente non proporcionou ningunha solicitude dentro do intervalo de tempo de espera do servidor.
webscript.code.409.name=Conflito
webscript.code.409.description=Non foi posible completar a solicitude debido \u00E1 existencia dun conflito co estado actual do recurso.
webscript.code.410.name=Conclu\u00EDdo
webscript.code.410.description=O recurso deixou de estar dispo\u00F1ible no servidor e non se co\u00F1ece ning\u00FAn enderezo de encami\u00F1amento.
webscript.code.411.name=Requ\u00EDrese lonxitude
webscript.code.411.description=Non se pode levar a cabo a solicitude sen definir a extensi\u00F3n do contido.
webscript.code.412.name=Fallo na precondici\u00F3n
webscript.code.412.description=A precondici\u00F3n fornecida nun ou m\u00E1is campos de cabeceira da solicitude foi avaliada como falsa ao ser probada no servidor.
webscript.code.413.name=Entidade demasiado longa
webscript.code.413.description=O servidor rexeita procesar a solicitude debido a que a entidade excede a lonxitude que \u00E9 capaz de procesar.
webscript.code.414.name=URI demasiado longo
webscript.code.414.description=O servidor rexeita revisar a solicitude debido a que o URI excede aquilo que \u00E9 capaz de interpretar.
webscript.code.415.name=Tipo de soporte multimedia incompatible
webscript.code.415.description=O servidor rexeita revisar a solicitude debido a que o formato da entidade \u00E9 incompatible co recurso solicitado para o m\u00E9todo solicitado.
webscript.code.416.name=Intervalo solicitado impracticable
webscript.code.416.description=O servidor non consegue atender o intervalo de bytes solicitado.
webscript.code.417.name=Fallo na expectativa
webscript.code.417.description=O servidor non puido satisfacer as expectativas indicadas na cabeceira Expect da solicitude.
webscript.code.500.name=Erro interno
webscript.code.500.description=Erro no servidor HTTP que lle impide satisfacer a solicitude.
webscript.code.501.name=Non aplicado
webscript.code.501.description=O servidor HTTP \u00E9 incompatible coa funcionalidade necesaria para satisfacer a solicitude.
webscript.code.502.name=Pasarela incorrecta
webscript.code.502.description=O servidor HTTP recibiu unha resposta incorrecta dun servidor consultado ao actuar como servidor mandatario ou pasarela.
webscript.code.503.name=Servizo non dispo\u00F1ible
webscript.code.503.description=O servidor HTTP est\u00E1 temporalmente sobrecargado e non consegue levar a cabo a solicitude.
webscript.code.504.name=Tempo de espera da pasarela
webscript.code.504.description=O servidor non recibiu en tempo ningunha resposta do servidor upstream ao actuar como servidor mandatario ou pasarela.
webscript.code.505.name=Versi\u00F3n de HTTP incompatible
webscript.code.505.description=O servidor \u00E9 incompatible (ou rexeita selo) coa versi\u00F3n de protocolo HTTP utilizada na mensaxe da solicitude.

##
## Test Web Script Server Help
##
testserver.help=alfresco/messages/webscripts-test-help.txt
